{
  "Title": "Pup karma",
  "Description": "Add full-fledged karma to your slugpups, the same as the player\u0027s!\r\nThumbnail and cutscenes made by [url=https://tinyslugcat.com/]scuglat[/url]\r\n\r\n[h2]Mod Features:[/h2]\r\n[list]\r\n[*][b]New HUD part:[/b] pup karma meter. Observe the state of karma of your slugpups.\r\n\r\n[*][b]Karma gates:[/b] use the slugpups karma to pass through the karma gate.\r\n\r\n[*][b]Karma flowers:[/b] the behavior of slugpups when eating karma flowers has been completely changed. The properties of karma flowers also apply to slugpups.\r\n\r\n[*][b]Interaction with Five Pebbles:[/b] now he increases karma for slugpups as well as for the player. A new interaction has also been added for artificer and slugpups (work only after visiting Pebbles).\r\n\r\n[*][b]The echoes:[/b] the echoes have also been changed, now they increase the karma of slugpups.\r\n\r\n[*][b]Depths and void sea:[/b] [spoiler]now the guardians allow slugpups with sufficient karma to enter the void sea. Also, slugpups will no longer fall out of the player\u0027s hands while in the void sea, which makes it possible to ascend with them. (Note: Rejoice! A new artist has been found for the cutscenes!)[/spoiler]\r\n\r\n[*][b]Compatibility with other mods:[/b] Pup Karma can work with other mods related to slugpups (and not only), the list of compatible mods will expand!\r\n\r\n[*][b]For slugpups creators:[/b] now Pup Karma has an API for registering your karma for the slugpups you create. This is the first API I\u0027ve created, and if you have any ideas on how to improve it, feel free to suggest its! Details on GitHub in README.md\r\n[/list]\r\n\r\n[h2]Configurable features:[/h2]\r\n[list]\r\n[*][b]Karma gate passage influence:[/b] choose how the slugpups karma should influence the passage through the karma gate.\r\n\r\n[*][b]Karma reinforce distribution:[/b] choose exactly how the karma reinforce will be distributed to the player and slugpups after eating the karma flower.\r\n\r\n[*][b]Echoes spawn requirements (untested):[/b] choose exactly how the slugpups karma should affect to the spawn echoes.\r\n\r\n[*][b]Pups spawn karma flowers:[/b] when enabled, slugpups can leave karma flowers after death (enabled by default).\r\n\r\n[*][b]Various features of karma assignment.[/b]\r\n\r\n[*][b]Hide pup karma meter.[/b]\r\n\r\n[*][b]Light up pup karma meter:[/b] lights up pup karma meter when slugpup holding karma flower and want to eat it (enabled by default).\r\n\r\n[*][b]Don\u0027t pick up player spawned karma flower:[/b] when enabled, slugpups will not pick up karma flowers left at the player\u0027s place of death (enabled by default).\r\n[/list]\r\n\r\n[h2]Compatible mods:[/h2]\r\n[list]\r\n[*][b]Dev Console:[/b] added new coommads to control slugpup karma.\r\n\r\n[*][b]PupAI[/b]\r\n\r\n[*][b]Slugpup Safari[/b]\r\n\r\n[*][b]RegionKit:[/b] the \u0022Big Karma Shrine\u0022 increases the karma of slugpups when passing through it.\r\n\r\n[*][b]Chasing Wind:[/b] now they has an interaction with slugpups, they increases their karma, just like the player. A new dialog has been added.\r\n[/list]\r\n\r\n[h1]How to use the Dev Console to control slugpup karma[/h1]\r\nIn total, for these purposes, I added two commands [b][u]karma_pups[/u][/b], [b][u]karma_cap_pups[/u][/b] and [b][u]assign_karma_to_slugpup[/u][/b]\r\nPups are accessed through their food meters numbers, in order to access pup, it is enough to start counting their food/karma meters from the bottom up, and then enter the values.\r\n[img]https://i.imgur.com/xi4OXyy.png[/img]\r\nWhen using the allPups command, the mod takes ALL existing pups, not just those that have their own food/karma meter.\r\nAn example of a command to assign karma reinforce to the 3rd pup:\r\n[code]karma_pups 3 reinforce[/code]\r\nThe same access rule applies to the karma_cap_pups command. For example: assignment of 9 karma cap to the 2nd pup\r\n[code]karma_cap_pups 2 9[/code]\r\n\r\n[h2]Most recent update:[/h2]\r\n[list]\r\n[*] Added new post-ascension scenes with slupups to the slugcat select menu, scenes made by scuglat\r\n\r\n[*] Slugpup mitosis related to echoes has been fixed\r\n\r\n[*] Additional penalties for slugpup\u0027s karma have been removed when they return to the shelter or are revived.\r\n[/list]\r\n\r\nGitHub mirror: https://github.com/Quansly/PupKarma\r\n\r\n[h3][b][i]In the end, I just want you to have fun playing with my mod.[/i] If you have found a bug, incompatibility, deviation in the behavior of AI slugpups, then write to Bug Reports or my discord (@quansly9034 / Quansly). Also, I do not refuse suggestions for improving this mod or ideas for creating other mods. Also, don\u0027t forget to rate my mod :)[/b][/h3]\r\n\r\nTags to search:\r\nkarma pups, pup karma, slugpup karma, karma slugpups",
  "ID": "quansly.pupkarma",
  "Version": "1.6.0",
  "TargetGameVersion": "v1.10.4",
  "Requirements": "moreslugcats",
  "RequirementNames": "More Slugcats",
  "Authors": "Quansly",
  "Visibility": "Public",
  "Tags": [
    "Game Mechanics"
  ],
  "WorkshopID": 3333225072,
  "UploadFilesOnly": false,
  "UploadThumbnail": false
}